[Killed] BlockStatement
src/lib/api/reportsResolve.ts:14:91
   resolution: ResolveInput;
 }
 
-export function buildResolvePayload(id: string, resolution: ResolveInput): ResolvePayload {
-  return {
-    report_id: id,
-    resolution,
-  };
-}
+export function buildResolvePayload(id: string, resolution: ResolveInput): ResolvePayload {}
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/unit/reportsResolve.test.ts tests/unit/tramitesCanonical.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-XV7l9D

[Killed] ObjectLiteral
src/lib/api/reportsResolve.ts:15:10
 }
 
 export function buildResolvePayload(id: string, resolution: ResolveInput): ResolvePayload {
-  return {
-    report_id: id,
-    resolution,
-  };
+  return {};
 }
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/unit/reportsResolve.test.ts tests/unit/tramitesCanonical.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-XV7l9D
