[Killed] BooleanLiteral
src/hooks/useAuth.ts:127:28
  * @returns Auth state, actions, and role utilities
  */
 export function useAuth(options: UseAuthOptions = {}): UseAuthReturn {
-  const { autoInitialize = true } = options;
+  const { autoInitialize = false } = options;
 
   // Get state from Zustand store using a single shallow selector
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] ArrowFunction
src/hooks/useAuth.ts:134:16
     user, session, profile, loading, initialized, error,
     initialize: storeInitialize, reset: storeReset
   } = useAuthStore(
-    useShallow((state) => ({
-      user: state.user,
-      session: state.session,
-      profile: state.profile,
-      loading: state.loading,
-      initialized: state.initialized,
-      error: state.error,
-      initialize: state.initialize,
-      reset: state.reset,
-    }))
+    useShallow(() => undefined)
   );
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] BlockStatement
src/hooks/useAuth.ts:147:19
   );
 
   // Auto-initialize on mount
-  useEffect(() => {
-    if (autoInitialize && !initialized) {
-      storeInitialize();
-    }
-  }, [autoInitialize, initialized, storeInitialize]);
+  useEffect(() => {}, [autoInitialize, initialized, storeInitialize]);
 
   // Derived state
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] ConditionalExpression
src/hooks/useAuth.ts:148:9
 
   // Auto-initialize on mount
   useEffect(() => {
-    if (autoInitialize && !initialized) {
+    if (false) {
       storeInitialize();
     }
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] LogicalOperator
src/hooks/useAuth.ts:148:9
 
   // Auto-initialize on mount
   useEffect(() => {
-    if (autoInitialize && !initialized) {
+    if (autoInitialize || !initialized) {
       storeInitialize();
     }
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Survived] ArrayDeclaration
src/hooks/useAuth.ts:151:6
     if (autoInitialize && !initialized) {
       storeInitialize();
     }
-  }, [autoInitialize, initialized, storeInitialize]);
+  }, []);
 
   // Derived state

[Killed] LogicalOperator
src/hooks/useAuth.ts:154:21
   }, [autoInitialize, initialized, storeInitialize]);
 
   // Derived state
-  const isLoading = loading || !initialized;
+  const isLoading = loading && !initialized;
   const isAuthenticated = !!user && !loading && initialized;
   const role: UserRole | null = (profile?.rol as UserRole) || null;
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] ConditionalExpression
src/hooks/useAuth.ts:154:21
   }, [autoInitialize, initialized, storeInitialize]);
 
   // Derived state
-  const isLoading = loading || !initialized;
+  const isLoading = false;
   const isAuthenticated = !!user && !loading && initialized;
   const role: UserRole | null = (profile?.rol as UserRole) || null;
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] BooleanLiteral
src/hooks/useAuth.ts:155:37
 
   // Derived state
   const isLoading = loading || !initialized;
-  const isAuthenticated = !!user && !loading && initialized;
+  const isAuthenticated = !!user && loading && initialized;
   const role: UserRole | null = (profile?.rol as UserRole) || null;
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] ConditionalExpression
src/hooks/useAuth.ts:155:27
 
   // Derived state
   const isLoading = loading || !initialized;
-  const isAuthenticated = !!user && !loading && initialized;
+  const isAuthenticated = false;
   const role: UserRole | null = (profile?.rol as UserRole) || null;
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] LogicalOperator
src/hooks/useAuth.ts:156:33
   // Derived state
   const isLoading = loading || !initialized;
   const isAuthenticated = !!user && !loading && initialized;
-  const role: UserRole | null = (profile?.rol as UserRole) || null;
+  const role: UserRole | null = profile?.rol as UserRole && null;
 
   // Role checking utilities - memoized to prevent unnecessary re-renders
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] ConditionalExpression
src/hooks/useAuth.ts:156:33
   // Derived state
   const isLoading = loading || !initialized;
   const isAuthenticated = !!user && !loading && initialized;
-  const role: UserRole | null = (profile?.rol as UserRole) || null;
+  const role: UserRole | null = true;
 
   // Role checking utilities - memoized to prevent unnecessary re-renders
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] BlockStatement
src/hooks/useAuth.ts:160:48
 
   // Role checking utilities - memoized to prevent unnecessary re-renders
   const hasRole = useCallback(
-    (roles: UserRole | UserRole[]): boolean => {
-      if (!isAuthenticated || !role) return false;
-      const rolesArray = Array.isArray(roles) ? roles : [roles];
-      return rolesArray.includes(role);
-    },
+    (roles: UserRole | UserRole[]): boolean => {},
     [isAuthenticated, role]
   );
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] ConditionalExpression
src/hooks/useAuth.ts:161:11
   // Role checking utilities - memoized to prevent unnecessary re-renders
   const hasRole = useCallback(
     (roles: UserRole | UserRole[]): boolean => {
-      if (!isAuthenticated || !role) return false;
+      if (true) return false;
       const rolesArray = Array.isArray(roles) ? roles : [roles];
       return rolesArray.includes(role);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] BooleanLiteral
src/hooks/useAuth.ts:161:31
   // Role checking utilities - memoized to prevent unnecessary re-renders
   const hasRole = useCallback(
     (roles: UserRole | UserRole[]): boolean => {
-      if (!isAuthenticated || !role) return false;
+      if (!isAuthenticated || role) return false;
       const rolesArray = Array.isArray(roles) ? roles : [roles];
       return rolesArray.includes(role);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Survived] ArrayDeclaration
src/hooks/useAuth.ts:165:5
       const rolesArray = Array.isArray(roles) ? roles : [roles];
       return rolesArray.includes(role);
     },
-    [isAuthenticated, role]
+    []
   );
 

[Killed] ArrowFunction
src/hooks/useAuth.ts:168:27
     [isAuthenticated, role]
   );
 
-  const isAdmin = useMemo(() => hasRole('admin'), [hasRole]);
+  const isAdmin = useMemo(() => undefined, [hasRole]);
   const isOperador = useMemo(() => hasRole('operador'), [hasRole]);
   const isStaff = useMemo(() => hasRole(['admin', 'operador']), [hasRole]);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] StringLiteral
src/hooks/useAuth.ts:168:41
     [isAuthenticated, role]
   );
 
-  const isAdmin = useMemo(() => hasRole('admin'), [hasRole]);
+  const isAdmin = useMemo(() => hasRole(""), [hasRole]);
   const isOperador = useMemo(() => hasRole('operador'), [hasRole]);
   const isStaff = useMemo(() => hasRole(['admin', 'operador']), [hasRole]);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] ArrowFunction
src/hooks/useAuth.ts:169:30
   );
 
   const isAdmin = useMemo(() => hasRole('admin'), [hasRole]);
-  const isOperador = useMemo(() => hasRole('operador'), [hasRole]);
+  const isOperador = useMemo(() => undefined, [hasRole]);
   const isStaff = useMemo(() => hasRole(['admin', 'operador']), [hasRole]);
   const isCiudadano = useMemo(() => hasRole('ciudadano'), [hasRole]);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] ArrowFunction
src/hooks/useAuth.ts:170:27
 
   const isAdmin = useMemo(() => hasRole('admin'), [hasRole]);
   const isOperador = useMemo(() => hasRole('operador'), [hasRole]);
-  const isStaff = useMemo(() => hasRole(['admin', 'operador']), [hasRole]);
+  const isStaff = useMemo(() => undefined, [hasRole]);
   const isCiudadano = useMemo(() => hasRole('ciudadano'), [hasRole]);
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] StringLiteral
src/hooks/useAuth.ts:170:42
 
   const isAdmin = useMemo(() => hasRole('admin'), [hasRole]);
   const isOperador = useMemo(() => hasRole('operador'), [hasRole]);
-  const isStaff = useMemo(() => hasRole(['admin', 'operador']), [hasRole]);
+  const isStaff = useMemo(() => hasRole(["", 'operador']), [hasRole]);
   const isCiudadano = useMemo(() => hasRole('ciudadano'), [hasRole]);
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] ArrowFunction
src/hooks/useAuth.ts:171:31
   const isAdmin = useMemo(() => hasRole('admin'), [hasRole]);
   const isOperador = useMemo(() => hasRole('operador'), [hasRole]);
   const isStaff = useMemo(() => hasRole(['admin', 'operador']), [hasRole]);
-  const isCiudadano = useMemo(() => hasRole('ciudadano'), [hasRole]);
+  const isCiudadano = useMemo(() => undefined, [hasRole]);
 
   const canAccess = useCallback(
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] BlockStatement
src/hooks/useAuth.ts:174:44
   const isCiudadano = useMemo(() => hasRole('ciudadano'), [hasRole]);
 
   const canAccess = useCallback(
-    (allowedRoles: UserRole[]): boolean => {
-      if (!isAuthenticated) return false;
-      if (allowedRoles.length === 0) return true; // No role restriction
-      return hasRole(allowedRoles);
-    },
+    (allowedRoles: UserRole[]): boolean => {},
     [isAuthenticated, hasRole]
   );
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] ConditionalExpression
src/hooks/useAuth.ts:175:11
 
   const canAccess = useCallback(
     (allowedRoles: UserRole[]): boolean => {
-      if (!isAuthenticated) return false;
+      if (true) return false;
       if (allowedRoles.length === 0) return true; // No role restriction
       return hasRole(allowedRoles);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] BooleanLiteral
src/hooks/useAuth.ts:175:11
 
   const canAccess = useCallback(
     (allowedRoles: UserRole[]): boolean => {
-      if (!isAuthenticated) return false;
+      if (isAuthenticated) return false;
       if (allowedRoles.length === 0) return true; // No role restriction
       return hasRole(allowedRoles);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] ConditionalExpression
src/hooks/useAuth.ts:176:11
   const canAccess = useCallback(
     (allowedRoles: UserRole[]): boolean => {
       if (!isAuthenticated) return false;
-      if (allowedRoles.length === 0) return true; // No role restriction
+      if (false) return true; // No role restriction
       return hasRole(allowedRoles);
     },
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] EqualityOperator
src/hooks/useAuth.ts:176:11
   const canAccess = useCallback(
     (allowedRoles: UserRole[]): boolean => {
       if (!isAuthenticated) return false;
-      if (allowedRoles.length === 0) return true; // No role restriction
+      if (allowedRoles.length !== 0) return true; // No role restriction
       return hasRole(allowedRoles);
     },
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] BlockStatement
src/hooks/useAuth.ts:183:93
   );
 
   // Actions - stable references using useCallback
-  const login = useCallback(async (email: string, password: string): Promise<AuthResult> => {
-    return signInWithEmail(email, password);
-  }, []);
+  const login = useCallback(async (email: string, password: string): Promise<AuthResult> => {}, []);
 
   const loginWithGoogle = useCallback(async (): Promise<AuthResult> => {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] BlockStatement
src/hooks/useAuth.ts:187:72
     return signInWithEmail(email, password);
   }, []);
 
-  const loginWithGoogle = useCallback(async (): Promise<AuthResult> => {
-    return signInWithGoogle();
-  }, []);
+  const loginWithGoogle = useCallback(async (): Promise<AuthResult> => {}, []);
 
   const register = useCallback(
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] BlockStatement
src/hooks/useAuth.ts:192:86
   }, []);
 
   const register = useCallback(
-    async (email: string, password: string, nombre?: string): Promise<AuthResult> => {
-      return signUpWithEmail(email, password, nombre);
-    },
+    async (email: string, password: string, nombre?: string): Promise<AuthResult> => {},
     []
   );
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] BlockStatement
src/hooks/useAuth.ts:198:63
     []
   );
 
-  const logout = useCallback(async (): Promise<AuthResult> => {
-    return signOut();
-  }, []);
+  const logout = useCallback(async (): Promise<AuthResult> => {}, []);
 
   const initialize = useCallback(async (): Promise<void> => {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] BlockStatement
src/hooks/useAuth.ts:202:61
     return signOut();
   }, []);
 
-  const initialize = useCallback(async (): Promise<void> => {
-    return storeInitialize();
-  }, [storeInitialize]);
+  const initialize = useCallback(async (): Promise<void> => {}, [storeInitialize]);
 
   const reset = useCallback((): void => {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Killed] BlockStatement
src/hooks/useAuth.ts:206:41
     return storeInitialize();
   }, [storeInitialize]);
 
-  const reset = useCallback((): void => {
-    storeReset();
-  }, [storeReset]);
+  const reset = useCallback((): void => {}, [storeReset]);
 
   return {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useAuth.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-cW1GCB

[Survived] ArrayDeclaration
src/hooks/useAuth.ts:208:6
 
   const reset = useCallback((): void => {
     storeReset();
-  }, [storeReset]);
+  }, []);
 
   return {
