[Survived] ArrowFunction
src/hooks/useContactVerification.ts:65:29
   const { onVerified } = options;
 
   // Estado del auth store
-  const user = useAuthStore((state) => state.user);
+  const user = useAuthStore(() => undefined);
   const profile = useAuthStore((state) => state.profile);
   const initialized = useAuthStore((state) => state.initialized);

[Survived] ArrowFunction
src/hooks/useContactVerification.ts:66:32
 
   // Estado del auth store
   const user = useAuthStore((state) => state.user);
-  const profile = useAuthStore((state) => state.profile);
+  const profile = useAuthStore(() => undefined);
   const initialized = useAuthStore((state) => state.initialized);
   const authLoading = useAuthStore((state) => state.loading);

[Survived] ArrowFunction
src/hooks/useContactVerification.ts:67:36
   // Estado del auth store
   const user = useAuthStore((state) => state.user);
   const profile = useAuthStore((state) => state.profile);
-  const initialized = useAuthStore((state) => state.initialized);
+  const initialized = useAuthStore(() => undefined);
   const authLoading = useAuthStore((state) => state.loading);
 

[Killed] ArrowFunction
src/hooks/useContactVerification.ts:68:36
   const user = useAuthStore((state) => state.user);
   const profile = useAuthStore((state) => state.profile);
   const initialized = useAuthStore((state) => state.initialized);
-  const authLoading = useAuthStore((state) => state.loading);
+  const authLoading = useAuthStore(() => undefined);
 
   // Estado local
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Killed] BooleanLiteral
src/hooks/useContactVerification.ts:72:42
 
   // Estado local
   const [metodoVerificacion, setMetodoVerificacion] = useState<VerificationMethod>('google');
-  const [loading, setLoading] = useState(false);
+  const [loading, setLoading] = useState(true);
   const [magicLinkSent, setMagicLinkSent] = useState(false);
   const [magicLinkEmail, setMagicLinkEmail] = useState<string | null>(null);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Killed] BooleanLiteral
src/hooks/useContactVerification.ts:73:54
   // Estado local
   const [metodoVerificacion, setMetodoVerificacion] = useState<VerificationMethod>('google');
   const [loading, setLoading] = useState(false);
-  const [magicLinkSent, setMagicLinkSent] = useState(false);
+  const [magicLinkSent, setMagicLinkSent] = useState(true);
   const [magicLinkEmail, setMagicLinkEmail] = useState<string | null>(null);
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Killed] BooleanLiteral
src/hooks/useContactVerification.ts:77:30
   const [magicLinkEmail, setMagicLinkEmail] = useState<string | null>(null);
 
   // Derivar estado de verificacion del auth store
-  const contactoVerificado = !!user && initialized;
+  const contactoVerificado = !user && initialized;
   const userEmail = user?.email || null;
   const userName = profile?.nombre || user?.user_metadata?.full_name || user?.user_metadata?.name || null;
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Killed] OptionalChaining
src/hooks/useContactVerification.ts:78:21
 
   // Derivar estado de verificacion del auth store
   const contactoVerificado = !!user && initialized;
-  const userEmail = user?.email || null;
+  const userEmail = user.email || null;
   const userName = profile?.nombre || user?.user_metadata?.full_name || user?.user_metadata?.name || null;
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Killed] LogicalOperator
src/hooks/useContactVerification.ts:78:21
 
   // Derivar estado de verificacion del auth store
   const contactoVerificado = !!user && initialized;
-  const userEmail = user?.email || null;
+  const userEmail = user?.email && null;
   const userName = profile?.nombre || user?.user_metadata?.full_name || user?.user_metadata?.name || null;
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Killed] LogicalOperator
src/hooks/useContactVerification.ts:79:20
   // Derivar estado de verificacion del auth store
   const contactoVerificado = !!user && initialized;
   const userEmail = user?.email || null;
-  const userName = profile?.nombre || user?.user_metadata?.full_name || user?.user_metadata?.name || null;
+  const userName = (profile?.nombre || user?.user_metadata?.full_name || user?.user_metadata?.name) && null;
 
   // Notificar cuando se verifica
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Killed] ConditionalExpression
src/hooks/useContactVerification.ts:79:20
   // Derivar estado de verificacion del auth store
   const contactoVerificado = !!user && initialized;
   const userEmail = user?.email || null;
-  const userName = profile?.nombre || user?.user_metadata?.full_name || user?.user_metadata?.name || null;
+  const userName = false;
 
   // Notificar cuando se verifica
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Survived] BlockStatement
src/hooks/useContactVerification.ts:82:19
   const userName = profile?.nombre || user?.user_metadata?.full_name || user?.user_metadata?.name || null;
 
   // Notificar cuando se verifica
-  useEffect(() => {
-    if (contactoVerificado && userEmail && onVerified) {
-      onVerified(userEmail, userName || undefined);
-    }
-  }, [contactoVerificado, userEmail, userName, onVerified]);
+  useEffect(() => {}, [contactoVerificado, userEmail, userName, onVerified]);
 
   // Login con Google OAuth

[Killed] ConditionalExpression
src/hooks/useContactVerification.ts:83:9
 
   // Notificar cuando se verifica
   useEffect(() => {
-    if (contactoVerificado && userEmail && onVerified) {
+    if (true) {
       onVerified(userEmail, userName || undefined);
     }
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Survived] ConditionalExpression
src/hooks/useContactVerification.ts:83:9
 
   // Notificar cuando se verifica
   useEffect(() => {
-    if (contactoVerificado && userEmail && onVerified) {
+    if (false) {
       onVerified(userEmail, userName || undefined);
     }

[Survived] LogicalOperator
src/hooks/useContactVerification.ts:84:29
   // Notificar cuando se verifica
   useEffect(() => {
     if (contactoVerificado && userEmail && onVerified) {
-      onVerified(userEmail, userName || undefined);
+      onVerified(userEmail, userName && undefined);
     }
   }, [contactoVerificado, userEmail, userName, onVerified]);

[Survived] ConditionalExpression
src/hooks/useContactVerification.ts:84:29
   // Notificar cuando se verifica
   useEffect(() => {
     if (contactoVerificado && userEmail && onVerified) {
-      onVerified(userEmail, userName || undefined);
+      onVerified(userEmail, true);
     }
   }, [contactoVerificado, userEmail, userName, onVerified]);

[Survived] ArrayDeclaration
src/hooks/useContactVerification.ts:86:6
     if (contactoVerificado && userEmail && onVerified) {
       onVerified(userEmail, userName || undefined);
     }
-  }, [contactoVerificado, userEmail, userName, onVerified]);
+  }, []);
 
   // Login con Google OAuth

[Survived] BooleanLiteral
src/hooks/useContactVerification.ts:90:16
 
   // Login con Google OAuth
   const loginWithGoogle = useCallback(async () => {
-    setLoading(true);
+    setLoading(false);
     try {
       const supabase = getSupabaseClient();

[Killed] BlockStatement
src/hooks/useContactVerification.ts:91:9
   // Login con Google OAuth
   const loginWithGoogle = useCallback(async () => {
     setLoading(true);
-    try {
-      const supabase = getSupabaseClient();
-      const { error } = await supabase.auth.signInWithOAuth({
-        provider: 'google',
-        options: {
-          redirectTo: `${window.location.origin}${window.location.pathname}?auth=success`,
-          queryParams: {
-            access_type: 'offline',
-            prompt: 'consent',
-          },
-        },
-      });
-
-      if (error) {
-        throw error;
-      }
-      // El redirect sucede automaticamente
-    } catch (error) {
+    try {} catch (error) {
       logger.error('Error en login con Google:', error);
       notifications.show({
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Killed] BlockStatement
src/hooks/useContactVerification.ts:108:21
         throw error;
       }
       // El redirect sucede automaticamente
-    } catch (error) {
-      logger.error('Error en login con Google:', error);
-      notifications.show({
-        title: 'Error',
-        message: 'No se pudo iniciar sesion con Google',
-        color: 'red',
-      });
-      setLoading(false);
-    }
+    } catch (error) {}
   }, []);
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Survived] StringLiteral
src/hooks/useContactVerification.ts:109:20
       }
       // El redirect sucede automaticamente
     } catch (error) {
-      logger.error('Error en login con Google:', error);
+      logger.error("", error);
       notifications.show({
         title: 'Error',

[Survived] StringLiteral
src/hooks/useContactVerification.ts:112:18
       logger.error('Error en login con Google:', error);
       notifications.show({
         title: 'Error',
-        message: 'No se pudo iniciar sesion con Google',
+        message: "",
         color: 'red',
       });

[Killed] BooleanLiteral
src/hooks/useContactVerification.ts:115:18
         message: 'No se pudo iniciar sesion con Google',
         color: 'red',
       });
-      setLoading(false);
+      setLoading(true);
     }
   }, []);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Killed] BlockStatement
src/hooks/useContactVerification.ts:122:31
   // Enviar magic link
   const sendMagicLink = useCallback(async (email: string) => {
     // Validacion usando validador centralizado
-    if (!isValidEmail(email)) {
-      notifications.show({
-        title: 'Email invalido',
-        message: 'Ingresa un email valido',
-        color: 'red',
-      });
-      return;
-    }
+    if (!isValidEmail(email)) {}
 
     setLoading(true);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Killed] BooleanLiteral
src/hooks/useContactVerification.ts:122:9
   // Enviar magic link
   const sendMagicLink = useCallback(async (email: string) => {
     // Validacion usando validador centralizado
-    if (!isValidEmail(email)) {
+    if (isValidEmail(email)) {
       notifications.show({
         title: 'Email invalido',
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Killed] ObjectLiteral
src/hooks/useContactVerification.ts:123:26
   const sendMagicLink = useCallback(async (email: string) => {
     // Validacion usando validador centralizado
     if (!isValidEmail(email)) {
-      notifications.show({
-        title: 'Email invalido',
-        message: 'Ingresa un email valido',
-        color: 'red',
-      });
+      notifications.show({});
       return;
     }
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Killed] BlockStatement
src/hooks/useContactVerification.ts:132:9
     }
 
     setLoading(true);
-    try {
-      const supabase = getSupabaseClient();
-      const { error } = await supabase.auth.signInWithOtp({
-        email,
-        options: {
-          emailRedirectTo: `${window.location.origin}${window.location.pathname}?auth=success`,
-        },
-      });
-
-      if (error) {
-        throw error;
-      }
-
-      setMagicLinkSent(true);
-      setMagicLinkEmail(email);
-      notifications.show({
-        title: 'Link enviado',
-        message: `Revisa tu email ${email}`,
-        color: 'green',
-      });
-    } catch (error) {
+    try {} catch (error) {
       logger.error('Error enviando magic link:', error);
       const message = error instanceof Error ? error.message : 'No se pudo enviar el email';
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Survived] ObjectLiteral
src/hooks/useContactVerification.ts:136:18
       const supabase = getSupabaseClient();
       const { error } = await supabase.auth.signInWithOtp({
         email,
-        options: {
-          emailRedirectTo: `${window.location.origin}${window.location.pathname}?auth=success`,
-        },
+        options: {},
       });
 

[Killed] BooleanLiteral
src/hooks/useContactVerification.ts:145:24
         throw error;
       }
 
-      setMagicLinkSent(true);
+      setMagicLinkSent(false);
       setMagicLinkEmail(email);
       notifications.show({
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Killed] StringLiteral
src/hooks/useContactVerification.ts:150:16
       notifications.show({
         title: 'Link enviado',
         message: `Revisa tu email ${email}`,
-        color: 'green',
+        color: "",
       });
     } catch (error) {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Killed] BlockStatement
src/hooks/useContactVerification.ts:152:21
         message: `Revisa tu email ${email}`,
         color: 'green',
       });
-    } catch (error) {
-      logger.error('Error enviando magic link:', error);
-      const message = error instanceof Error ? error.message : 'No se pudo enviar el email';
-      notifications.show({
-        title: 'Error',
-        message,
-        color: 'red',
-      });
-    } finally {
+    } catch (error) {} finally {
       setLoading(false);
     }
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Survived] StringLiteral
src/hooks/useContactVerification.ts:154:64
       });
     } catch (error) {
       logger.error('Error enviando magic link:', error);
-      const message = error instanceof Error ? error.message : 'No se pudo enviar el email';
+      const message = error instanceof Error ? error.message : "";
       notifications.show({
         title: 'Error',

[Killed] ObjectLiteral
src/hooks/useContactVerification.ts:155:26
     } catch (error) {
       logger.error('Error enviando magic link:', error);
       const message = error instanceof Error ? error.message : 'No se pudo enviar el email';
-      notifications.show({
-        title: 'Error',
-        message,
-        color: 'red',
-      });
+      notifications.show({});
     } finally {
       setLoading(false);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Killed] StringLiteral
src/hooks/useContactVerification.ts:158:16
       notifications.show({
         title: 'Error',
         message,
-        color: 'red',
+        color: "",
       });
     } finally {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Killed] BlockStatement
src/hooks/useContactVerification.ts:160:15
         message,
         color: 'red',
       });
-    } finally {
-      setLoading(false);
-    }
+    } finally {}
   }, []);
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Killed] BlockStatement
src/hooks/useContactVerification.ts:166:42
   }, []);
 
   // Logout
-  const logout = useCallback(async () => {
-    try {
-      const supabase = getSupabaseClient();
-      await supabase.auth.signOut();
-      notifications.show({
-        title: 'Sesion cerrada',
-        message: 'Has cerrado sesion correctamente',
-        color: 'blue',
-      });
-    } catch (error) {
-      logger.error('Error al cerrar sesion:', error);
-    }
-  }, []);
+  const logout = useCallback(async () => {}, []);
 
   // Reset
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Killed] BlockStatement
src/hooks/useContactVerification.ts:167:9
 
   // Logout
   const logout = useCallback(async () => {
-    try {
-      const supabase = getSupabaseClient();
-      await supabase.auth.signOut();
-      notifications.show({
-        title: 'Sesion cerrada',
-        message: 'Has cerrado sesion correctamente',
-        color: 'blue',
-      });
-    } catch (error) {
+    try {} catch (error) {
       logger.error('Error al cerrar sesion:', error);
     }
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Survived] StringLiteral
src/hooks/useContactVerification.ts:172:18
       await supabase.auth.signOut();
       notifications.show({
         title: 'Sesion cerrada',
-        message: 'Has cerrado sesion correctamente',
+        message: "",
         color: 'blue',
       });

[Survived] BlockStatement
src/hooks/useContactVerification.ts:175:21
         message: 'Has cerrado sesion correctamente',
         color: 'blue',
       });
-    } catch (error) {
-      logger.error('Error al cerrar sesion:', error);
-    }
+    } catch (error) {}
   }, []);
 

[Killed] BlockStatement
src/hooks/useContactVerification.ts:181:47
   }, []);
 
   // Reset
-  const resetVerificacion = useCallback(() => {
-    setMagicLinkSent(false);
-    setMagicLinkEmail(null);
-    setMetodoVerificacion('google');
-  }, []);
+  const resetVerificacion = useCallback(() => {}, []);
 
   return {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Killed] BooleanLiteral
src/hooks/useContactVerification.ts:182:22
 
   // Reset
   const resetVerificacion = useCallback(() => {
-    setMagicLinkSent(false);
+    setMagicLinkSent(true);
     setMagicLinkEmail(null);
     setMetodoVerificacion('google');
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Killed] ConditionalExpression
src/hooks/useContactVerification.ts:193:14
     userEmail,
     userName,
     metodoVerificacion,
-    loading: loading || authLoading,
+    loading: true,
     magicLinkSent,
     magicLinkEmail,
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-aToLyq

[Survived] ConditionalExpression
src/hooks/useContactVerification.ts:193:14
     userEmail,
     userName,
     metodoVerificacion,
-    loading: loading || authLoading,
+    loading: false,
     magicLinkSent,
     magicLinkEmail,
