[Survived] BooleanLiteral
src/hooks/useJobStatus.ts:20:46
   const [status, setStatus] = useState<JobStatus | 'IDLE'>('IDLE');
   const [result, setResult] = useState<T | null>(null);
   const [error, setError] = useState<string | null>(null);
-  const [isLoading, setIsLoading] = useState(false);
+  const [isLoading, setIsLoading] = useState(true);
 
   const checkStatus = useCallback(async () => {

[Killed] BlockStatement
src/hooks/useJobStatus.ts:22:47
   const [error, setError] = useState<string | null>(null);
   const [isLoading, setIsLoading] = useState(false);
 
-  const checkStatus = useCallback(async () => {
-    if (!jobId) return;
-
-    try {
-      const data = await apiFetch<JobResponse<T>>(`/jobs/${jobId}`);
-      setStatus(data.status);
-
-      if (data.status === 'SUCCESS' && data.result) {
-        setResult(data.result);
-        setIsLoading(false);
-        if (onCompleted) onCompleted(data.result);
-      } else if (data.status === 'FAILURE') {
-        setError(data.error || 'Job failed');
-        setIsLoading(false);
-      }
-    } catch (err) {
-      setError(err instanceof Error ? err.message : 'Error checking job status');
-      setIsLoading(false);
-    }
-  }, [jobId, onCompleted]);
+  const checkStatus = useCallback(async () => {}, [jobId, onCompleted]);
 
   useEffect(() => {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BooleanLiteral
src/hooks/useJobStatus.ts:23:9
   const [isLoading, setIsLoading] = useState(false);
 
   const checkStatus = useCallback(async () => {
-    if (!jobId) return;
+    if (jobId) return;
 
     try {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] ConditionalExpression
src/hooks/useJobStatus.ts:23:9
   const [isLoading, setIsLoading] = useState(false);
 
   const checkStatus = useCallback(async () => {
-    if (!jobId) return;
+    if (true) return;
 
     try {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BlockStatement
src/hooks/useJobStatus.ts:25:9
   const checkStatus = useCallback(async () => {
     if (!jobId) return;
 
-    try {
-      const data = await apiFetch<JobResponse<T>>(`/jobs/${jobId}`);
-      setStatus(data.status);
-
-      if (data.status === 'SUCCESS' && data.result) {
-        setResult(data.result);
-        setIsLoading(false);
-        if (onCompleted) onCompleted(data.result);
-      } else if (data.status === 'FAILURE') {
-        setError(data.error || 'Job failed');
-        setIsLoading(false);
-      }
-    } catch (err) {
+    try {} catch (err) {
       setError(err instanceof Error ? err.message : 'Error checking job status');
       setIsLoading(false);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BlockStatement
src/hooks/useJobStatus.ts:29:53
       const data = await apiFetch<JobResponse<T>>(`/jobs/${jobId}`);
       setStatus(data.status);
 
-      if (data.status === 'SUCCESS' && data.result) {
-        setResult(data.result);
-        setIsLoading(false);
-        if (onCompleted) onCompleted(data.result);
-      } else if (data.status === 'FAILURE') {
+      if (data.status === 'SUCCESS' && data.result) {} else if (data.status === 'FAILURE') {
         setError(data.error || 'Job failed');
         setIsLoading(false);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] ConditionalExpression
src/hooks/useJobStatus.ts:29:11
       const data = await apiFetch<JobResponse<T>>(`/jobs/${jobId}`);
       setStatus(data.status);
 
-      if (data.status === 'SUCCESS' && data.result) {
+      if (false) {
         setResult(data.result);
         setIsLoading(false);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts



 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Survived] BooleanLiteral
src/hooks/useJobStatus.ts:31:22
 
       if (data.status === 'SUCCESS' && data.result) {
         setResult(data.result);
-        setIsLoading(false);
+        setIsLoading(true);
         if (onCompleted) onCompleted(data.result);
       } else if (data.status === 'FAILURE') {

[Killed] ConditionalExpression
src/hooks/useJobStatus.ts:32:13
       if (data.status === 'SUCCESS' && data.result) {
         setResult(data.result);
         setIsLoading(false);
-        if (onCompleted) onCompleted(data.result);
+        if (false) onCompleted(data.result);
       } else if (data.status === 'FAILURE') {
         setError(data.error || 'Job failed');
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Survived] ConditionalExpression
src/hooks/useJobStatus.ts:32:13
       if (data.status === 'SUCCESS' && data.result) {
         setResult(data.result);
         setIsLoading(false);
-        if (onCompleted) onCompleted(data.result);
+        if (true) onCompleted(data.result);
       } else if (data.status === 'FAILURE') {
         setError(data.error || 'Job failed');

[Killed] ConditionalExpression
src/hooks/useJobStatus.ts:33:18
         setResult(data.result);
         setIsLoading(false);
         if (onCompleted) onCompleted(data.result);
-      } else if (data.status === 'FAILURE') {
+      } else if (false) {
         setError(data.error || 'Job failed');
         setIsLoading(false);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] EqualityOperator
src/hooks/useJobStatus.ts:33:18
         setResult(data.result);
         setIsLoading(false);
         if (onCompleted) onCompleted(data.result);
-      } else if (data.status === 'FAILURE') {
+      } else if (data.status !== 'FAILURE') {
         setError(data.error || 'Job failed');
         setIsLoading(false);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] ConditionalExpression
src/hooks/useJobStatus.ts:34:18
         setIsLoading(false);
         if (onCompleted) onCompleted(data.result);
       } else if (data.status === 'FAILURE') {
-        setError(data.error || 'Job failed');
+        setError(true);
         setIsLoading(false);
       }
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] LogicalOperator
src/hooks/useJobStatus.ts:34:18
         setIsLoading(false);
         if (onCompleted) onCompleted(data.result);
       } else if (data.status === 'FAILURE') {
-        setError(data.error || 'Job failed');
+        setError(data.error && 'Job failed');
         setIsLoading(false);
       }
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Survived] BooleanLiteral
src/hooks/useJobStatus.ts:35:22
         if (onCompleted) onCompleted(data.result);
       } else if (data.status === 'FAILURE') {
         setError(data.error || 'Job failed');
-        setIsLoading(false);
+        setIsLoading(true);
       }
     } catch (err) {

[Killed] BlockStatement
src/hooks/useJobStatus.ts:37:19
         setError(data.error || 'Job failed');
         setIsLoading(false);
       }
-    } catch (err) {
-      setError(err instanceof Error ? err.message : 'Error checking job status');
-      setIsLoading(false);
-    }
+    } catch (err) {}
   }, [jobId, onCompleted]);
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] StringLiteral
src/hooks/useJobStatus.ts:38:53
         setIsLoading(false);
       }
     } catch (err) {
-      setError(err instanceof Error ? err.message : 'Error checking job status');
+      setError(err instanceof Error ? err.message : "");
       setIsLoading(false);
     }
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BooleanLiteral
src/hooks/useJobStatus.ts:39:20
       }
     } catch (err) {
       setError(err instanceof Error ? err.message : 'Error checking job status');
-      setIsLoading(false);
+      setIsLoading(true);
     }
   }, [jobId, onCompleted]);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BlockStatement
src/hooks/useJobStatus.ts:43:19
     }
   }, [jobId, onCompleted]);
 
-  useEffect(() => {
-    if (!jobId) {
-      setStatus('IDLE');
-      setResult(null);
-      setError(null);
-      setIsLoading(false);
-      return;
-    }
-
-    setIsLoading(true);
-    setStatus('PENDING');
-    
-    // Start polling
-    const interval = setInterval(() => {
-      if (status !== 'SUCCESS' && status !== 'FAILURE') {
-        checkStatus();
-      } else {
-        clearInterval(interval);
-      }
-    }, 2000); // Check every 2 seconds
-
-    return () => clearInterval(interval);
-  }, [jobId, status, checkStatus]);
+  useEffect(() => {}, [jobId, status, checkStatus]);
 
   return { status, result, error, isLoading };
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BooleanLiteral
src/hooks/useJobStatus.ts:44:9
   }, [jobId, onCompleted]);
 
   useEffect(() => {
-    if (!jobId) {
+    if (jobId) {
       setStatus('IDLE');
       setResult(null);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BlockStatement
src/hooks/useJobStatus.ts:44:17
   }, [jobId, onCompleted]);
 
   useEffect(() => {
-    if (!jobId) {
-      setStatus('IDLE');
-      setResult(null);
-      setError(null);
-      setIsLoading(false);
-      return;
-    }
+    if (!jobId) {}
 
     setIsLoading(true);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BooleanLiteral
src/hooks/useJobStatus.ts:48:20
       setStatus('IDLE');
       setResult(null);
       setError(null);
-      setIsLoading(false);
+      setIsLoading(true);
       return;
     }
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] StringLiteral
src/hooks/useJobStatus.ts:53:15
     }
 
     setIsLoading(true);
-    setStatus('PENDING');
+    setStatus("");
     
     // Start polling
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BlockStatement
src/hooks/useJobStatus.ts:56:40
     setStatus('PENDING');
     
     // Start polling
-    const interval = setInterval(() => {
-      if (status !== 'SUCCESS' && status !== 'FAILURE') {
-        checkStatus();
-      } else {
-        clearInterval(interval);
-      }
-    }, 2000); // Check every 2 seconds
+    const interval = setInterval(() => {}, 2000); // Check every 2 seconds
 
     return () => clearInterval(interval);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] EqualityOperator
src/hooks/useJobStatus.ts:57:35
     
     // Start polling
     const interval = setInterval(() => {
-      if (status !== 'SUCCESS' && status !== 'FAILURE') {
+      if (status !== 'SUCCESS' && status === 'FAILURE') {
         checkStatus();
       } else {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] ConditionalExpression
src/hooks/useJobStatus.ts:57:11
     
     // Start polling
     const interval = setInterval(() => {
-      if (status !== 'SUCCESS' && status !== 'FAILURE') {
+      if (false) {
         checkStatus();
       } else {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Survived] BlockStatement
src/hooks/useJobStatus.ts:59:14
     const interval = setInterval(() => {
       if (status !== 'SUCCESS' && status !== 'FAILURE') {
         checkStatus();
-      } else {
-        clearInterval(interval);
-      }
+      } else {}
     }, 2000); // Check every 2 seconds
 

[Killed] ArrayDeclaration
src/hooks/useJobStatus.ts:65:6
     }, 2000); // Check every 2 seconds
 
     return () => clearInterval(interval);
-  }, [jobId, status, checkStatus]);
+  }, []);
 
   return { status, result, error, isLoading };
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web
