[Survived] BooleanLiteral
src/hooks/useImageComparison.ts:24:46
  */
 export function useImageComparison() {
   const [comparison, setComparisonState] = useState<ImageComparison | null>(null);
-  const [isLoading, setIsLoading] = useState(true);
+  const [isLoading, setIsLoading] = useState(false);
 
   // Load from localStorage on mount with validation

[Killed] BlockStatement
src/hooks/useImageComparison.ts:27:19
   const [isLoading, setIsLoading] = useState(true);
 
   // Load from localStorage on mount with validation
-  useEffect(() => {
-    try {
-      const stored = localStorage.getItem(STORAGE_KEY);
-      if (stored) {
-        const parsed = JSON.parse(stored);
-        // Validate data structure before using
-        if (isValidImageComparison(parsed)) {
-          setComparisonState(parsed as ImageComparison);
-        } else {
-          // Invalid data, clean up
-          localStorage.removeItem(STORAGE_KEY);
-        }
-      }
-    } catch {
-      localStorage.removeItem(STORAGE_KEY);
-    } finally {
-      setIsLoading(false);
-    }
-  }, []);
+  useEffect(() => {}, []);
 
   // Set left image
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] BlockStatement
src/hooks/useImageComparison.ts:28:9
 
   // Load from localStorage on mount with validation
   useEffect(() => {
-    try {
-      const stored = localStorage.getItem(STORAGE_KEY);
-      if (stored) {
-        const parsed = JSON.parse(stored);
-        // Validate data structure before using
-        if (isValidImageComparison(parsed)) {
-          setComparisonState(parsed as ImageComparison);
-        } else {
-          // Invalid data, clean up
-          localStorage.removeItem(STORAGE_KEY);
-        }
-      }
-    } catch {
+    try {} catch {
       localStorage.removeItem(STORAGE_KEY);
     } finally {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] BlockStatement
src/hooks/useImageComparison.ts:30:19
   useEffect(() => {
     try {
       const stored = localStorage.getItem(STORAGE_KEY);
-      if (stored) {
-        const parsed = JSON.parse(stored);
-        // Validate data structure before using
-        if (isValidImageComparison(parsed)) {
-          setComparisonState(parsed as ImageComparison);
-        } else {
-          // Invalid data, clean up
-          localStorage.removeItem(STORAGE_KEY);
-        }
-      }
+      if (stored) {}
     } catch {
       localStorage.removeItem(STORAGE_KEY);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] ConditionalExpression
src/hooks/useImageComparison.ts:33:13
       if (stored) {
         const parsed = JSON.parse(stored);
         // Validate data structure before using
-        if (isValidImageComparison(parsed)) {
+        if (true) {
           setComparisonState(parsed as ImageComparison);
         } else {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] BlockStatement
src/hooks/useImageComparison.ts:33:45
       if (stored) {
         const parsed = JSON.parse(stored);
         // Validate data structure before using
-        if (isValidImageComparison(parsed)) {
-          setComparisonState(parsed as ImageComparison);
-        } else {
+        if (isValidImageComparison(parsed)) {} else {
           // Invalid data, clean up
           localStorage.removeItem(STORAGE_KEY);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] BlockStatement
src/hooks/useImageComparison.ts:35:16
         // Validate data structure before using
         if (isValidImageComparison(parsed)) {
           setComparisonState(parsed as ImageComparison);
-        } else {
-          // Invalid data, clean up
-          localStorage.removeItem(STORAGE_KEY);
-        }
+        } else {}
       }
     } catch {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] BlockStatement
src/hooks/useImageComparison.ts:40:13
           localStorage.removeItem(STORAGE_KEY);
         }
       }
-    } catch {
-      localStorage.removeItem(STORAGE_KEY);
-    } finally {
+    } catch {} finally {
       setIsLoading(false);
     }
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] BlockStatement
src/hooks/useImageComparison.ts:48:62
   }, []);
 
   // Set left image
-  const setLeftImage = useCallback((image: SelectedImage) => {
-    setComparisonState((prev) => {
-      const newComparison: ImageComparison = {
-        left: image,
-        right: prev?.right || image,
-        enabled: prev?.enabled ?? true,
-      };
-      localStorage.setItem(STORAGE_KEY, JSON.stringify(newComparison));
-      window.dispatchEvent(new CustomEvent('imageComparisonChange', { detail: newComparison }));
-      return newComparison;
-    });
-  }, []);
+  const setLeftImage = useCallback((image: SelectedImage) => {}, []);
 
   // Set right image
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] BlockStatement
src/hooks/useImageComparison.ts:49:34
 
   // Set left image
   const setLeftImage = useCallback((image: SelectedImage) => {
-    setComparisonState((prev) => {
-      const newComparison: ImageComparison = {
-        left: image,
-        right: prev?.right || image,
-        enabled: prev?.enabled ?? true,
-      };
-      localStorage.setItem(STORAGE_KEY, JSON.stringify(newComparison));
-      window.dispatchEvent(new CustomEvent('imageComparisonChange', { detail: newComparison }));
-      return newComparison;
-    });
+    setComparisonState((prev) => {});
   }, []);
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] ObjectLiteral
src/hooks/useImageComparison.ts:50:46
   // Set left image
   const setLeftImage = useCallback((image: SelectedImage) => {
     setComparisonState((prev) => {
-      const newComparison: ImageComparison = {
-        left: image,
-        right: prev?.right || image,
-        enabled: prev?.enabled ?? true,
-      };
+      const newComparison: ImageComparison = {};
       localStorage.setItem(STORAGE_KEY, JSON.stringify(newComparison));
       window.dispatchEvent(new CustomEvent('imageComparisonChange', { detail: newComparison }));
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] OptionalChaining
src/hooks/useImageComparison.ts:52:16
     setComparisonState((prev) => {
       const newComparison: ImageComparison = {
         left: image,
-        right: prev?.right || image,
+        right: prev.right || image,
         enabled: prev?.enabled ?? true,
       };
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] ConditionalExpression
src/hooks/useImageComparison.ts:52:16
     setComparisonState((prev) => {
       const newComparison: ImageComparison = {
         left: image,
-        right: prev?.right || image,
+        right: true,
         enabled: prev?.enabled ?? true,
       };
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] OptionalChaining
src/hooks/useImageComparison.ts:53:18
       const newComparison: ImageComparison = {
         left: image,
         right: prev?.right || image,
-        enabled: prev?.enabled ?? true,
+        enabled: prev.enabled ?? true,
       };
       localStorage.setItem(STORAGE_KEY, JSON.stringify(newComparison));
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] LogicalOperator
src/hooks/useImageComparison.ts:53:18
       const newComparison: ImageComparison = {
         left: image,
         right: prev?.right || image,
-        enabled: prev?.enabled ?? true,
+        enabled: prev?.enabled && true,
       };
       localStorage.setItem(STORAGE_KEY, JSON.stringify(newComparison));
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Survived] ObjectLiteral
src/hooks/useImageComparison.ts:56:69
         enabled: prev?.enabled ?? true,
       };
       localStorage.setItem(STORAGE_KEY, JSON.stringify(newComparison));
-      window.dispatchEvent(new CustomEvent('imageComparisonChange', { detail: newComparison }));
+      window.dispatchEvent(new CustomEvent('imageComparisonChange', {}));
       return newComparison;
     });

[Killed] BlockStatement
src/hooks/useImageComparison.ts:62:63
   }, []);
 
   // Set right image
-  const setRightImage = useCallback((image: SelectedImage) => {
-    setComparisonState((prev) => {
-      const newComparison: ImageComparison = {
-        left: prev?.left || image,
-        right: image,
-        enabled: prev?.enabled ?? true,
-      };
-      localStorage.setItem(STORAGE_KEY, JSON.stringify(newComparison));
-      window.dispatchEvent(new CustomEvent('imageComparisonChange', { detail: newComparison }));
-      return newComparison;
-    });
-  }, []);
+  const setRightImage = useCallback((image: SelectedImage) => {}, []);
 
   // Enable/disable comparison
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] BlockStatement
src/hooks/useImageComparison.ts:63:34
 
   // Set right image
   const setRightImage = useCallback((image: SelectedImage) => {
-    setComparisonState((prev) => {
-      const newComparison: ImageComparison = {
-        left: prev?.left || image,
-        right: image,
-        enabled: prev?.enabled ?? true,
-      };
-      localStorage.setItem(STORAGE_KEY, JSON.stringify(newComparison));
-      window.dispatchEvent(new CustomEvent('imageComparisonChange', { detail: newComparison }));
-      return newComparison;
-    });
+    setComparisonState((prev) => {});
   }, []);
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] ObjectLiteral
src/hooks/useImageComparison.ts:64:46
   // Set right image
   const setRightImage = useCallback((image: SelectedImage) => {
     setComparisonState((prev) => {
-      const newComparison: ImageComparison = {
-        left: prev?.left || image,
-        right: image,
-        enabled: prev?.enabled ?? true,
-      };
+      const newComparison: ImageComparison = {};
       localStorage.setItem(STORAGE_KEY, JSON.stringify(newComparison));
       window.dispatchEvent(new CustomEvent('imageComparisonChange', { detail: newComparison }));
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] LogicalOperator
src/hooks/useImageComparison.ts:65:15
   const setRightImage = useCallback((image: SelectedImage) => {
     setComparisonState((prev) => {
       const newComparison: ImageComparison = {
-        left: prev?.left || image,
+        left: prev?.left && image,
         right: image,
         enabled: prev?.enabled ?? true,
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] ConditionalExpression
src/hooks/useImageComparison.ts:65:15
   const setRightImage = useCallback((image: SelectedImage) => {
     setComparisonState((prev) => {
       const newComparison: ImageComparison = {
-        left: prev?.left || image,
+        left: false,
         right: image,
         enabled: prev?.enabled ?? true,
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] OptionalChaining
src/hooks/useImageComparison.ts:67:18
       const newComparison: ImageComparison = {
         left: prev?.left || image,
         right: image,
-        enabled: prev?.enabled ?? true,
+        enabled: prev.enabled ?? true,
       };
       localStorage.setItem(STORAGE_KEY, JSON.stringify(newComparison));
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Survived] LogicalOperator
src/hooks/useImageComparison.ts:67:18
       const newComparison: ImageComparison = {
         left: prev?.left || image,
         right: image,
-        enabled: prev?.enabled ?? true,
+        enabled: prev?.enabled && true,
       };
       localStorage.setItem(STORAGE_KEY, JSON.stringify(newComparison));

[Killed] BlockStatement
src/hooks/useImageComparison.ts:76:56
   }, []);
 
   // Enable/disable comparison
-  const setEnabled = useCallback((enabled: boolean) => {
-    setComparisonState((prev) => {
-      if (!prev) return null;
-      const newComparison = { ...prev, enabled };
-      localStorage.setItem(STORAGE_KEY, JSON.stringify(newComparison));
-      window.dispatchEvent(new CustomEvent('imageComparisonChange', { detail: newComparison }));
-      return newComparison;
-    });
-  }, []);
+  const setEnabled = useCallback((enabled: boolean) => {}, []);
 
   // Clear comparison
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] BlockStatement
src/hooks/useImageComparison.ts:77:34
 
   // Enable/disable comparison
   const setEnabled = useCallback((enabled: boolean) => {
-    setComparisonState((prev) => {
-      if (!prev) return null;
-      const newComparison = { ...prev, enabled };
-      localStorage.setItem(STORAGE_KEY, JSON.stringify(newComparison));
-      window.dispatchEvent(new CustomEvent('imageComparisonChange', { detail: newComparison }));
-      return newComparison;
-    });
+    setComparisonState((prev) => {});
   }, []);
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] ConditionalExpression
src/hooks/useImageComparison.ts:78:11
   // Enable/disable comparison
   const setEnabled = useCallback((enabled: boolean) => {
     setComparisonState((prev) => {
-      if (!prev) return null;
+      if (false) return null;
       const newComparison = { ...prev, enabled };
       localStorage.setItem(STORAGE_KEY, JSON.stringify(newComparison));
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] ConditionalExpression
src/hooks/useImageComparison.ts:78:11
   // Enable/disable comparison
   const setEnabled = useCallback((enabled: boolean) => {
     setComparisonState((prev) => {
-      if (!prev) return null;
+      if (true) return null;
       const newComparison = { ...prev, enabled };
       localStorage.setItem(STORAGE_KEY, JSON.stringify(newComparison));
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Survived] StringLiteral
src/hooks/useImageComparison.ts:81:44
       if (!prev) return null;
       const newComparison = { ...prev, enabled };
       localStorage.setItem(STORAGE_KEY, JSON.stringify(newComparison));
-      window.dispatchEvent(new CustomEvent('imageComparisonChange', { detail: newComparison }));
+      window.dispatchEvent(new CustomEvent("", { detail: newComparison }));
       return newComparison;
     });

[Killed] BlockStatement
src/hooks/useImageComparison.ts:87:45
   }, []);
 
   // Clear comparison
-  const clearComparison = useCallback(() => {
-    localStorage.removeItem(STORAGE_KEY);
-    setComparisonState(null);
-    window.dispatchEvent(new CustomEvent('imageComparisonChange', { detail: null }));
-  }, []);
+  const clearComparison = useCallback(() => {}, []);
 
   // Check if both images are set
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Survived] StringLiteral
src/hooks/useImageComparison.ts:90:42
   const clearComparison = useCallback(() => {
     localStorage.removeItem(STORAGE_KEY);
     setComparisonState(null);
-    window.dispatchEvent(new CustomEvent('imageComparisonChange', { detail: null }));
+    window.dispatchEvent(new CustomEvent("", { detail: null }));
   }, []);
 

[Survived] ObjectLiteral
src/hooks/useImageComparison.ts:90:67
   const clearComparison = useCallback(() => {
     localStorage.removeItem(STORAGE_KEY);
     setComparisonState(null);
-    window.dispatchEvent(new CustomEvent('imageComparisonChange', { detail: null }));
+    window.dispatchEvent(new CustomEvent('imageComparisonChange', {}));
   }, []);
 

[Killed] ConditionalExpression
src/hooks/useImageComparison.ts:94:19
   }, []);
 
   // Check if both images are set
-  const isReady = comparison?.left && comparison?.right;
+  const isReady = false;
 
   return {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] OptionalChaining
src/hooks/useImageComparison.ts:94:19
   }, []);
 
   // Check if both images are set
-  const isReady = comparison?.left && comparison?.right;
+  const isReady = comparison.left && comparison?.right;
 
   return {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] BlockStatement
src/hooks/useImageComparison.ts:116:9
 
   useEffect(() => {
     // Load initial value with validation
-    try {
-      const stored = localStorage.getItem(STORAGE_KEY);
-      if (stored) {
-        const parsed = JSON.parse(stored);
-        if (isValidImageComparison(parsed)) {
-          setComparison(parsed as ImageComparison);
-        } else {
-          localStorage.removeItem(STORAGE_KEY);
-        }
-      }
-    } catch {
+    try {} catch {
       localStorage.removeItem(STORAGE_KEY);
     }
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] BlockStatement
src/hooks/useImageComparison.ts:118:19
     // Load initial value with validation
     try {
       const stored = localStorage.getItem(STORAGE_KEY);
-      if (stored) {
-        const parsed = JSON.parse(stored);
-        if (isValidImageComparison(parsed)) {
-          setComparison(parsed as ImageComparison);
-        } else {
-          localStorage.removeItem(STORAGE_KEY);
-        }
-      }
+      if (stored) {}
     } catch {
       localStorage.removeItem(STORAGE_KEY);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] ConditionalExpression
src/hooks/useImageComparison.ts:120:13
       const stored = localStorage.getItem(STORAGE_KEY);
       if (stored) {
         const parsed = JSON.parse(stored);
-        if (isValidImageComparison(parsed)) {
+        if (false) {
           setComparison(parsed as ImageComparison);
         } else {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] BlockStatement
src/hooks/useImageComparison.ts:120:45
       const stored = localStorage.getItem(STORAGE_KEY);
       if (stored) {
         const parsed = JSON.parse(stored);
-        if (isValidImageComparison(parsed)) {
-          setComparison(parsed as ImageComparison);
-        } else {
+        if (isValidImageComparison(parsed)) {} else {
           localStorage.removeItem(STORAGE_KEY);
         }
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Survived] BlockStatement
src/hooks/useImageComparison.ts:122:16
         const parsed = JSON.parse(stored);
         if (isValidImageComparison(parsed)) {
           setComparison(parsed as ImageComparison);
-        } else {
-          localStorage.removeItem(STORAGE_KEY);
-        }
+        } else {}
       }
     } catch {

[Killed] BlockStatement
src/hooks/useImageComparison.ts:131:79
     }
 
     // Listen for custom events (same tab)
-    const handleCustomEvent = (event: CustomEvent<ImageComparison | null>) => {
-      // Validate even from custom events for extra safety
-      if (event.detail === null || isValidImageComparison(event.detail)) {
-        setComparison(event.detail as ImageComparison | null);
-      }
-    };
+    const handleCustomEvent = (event: CustomEvent<ImageComparison | null>) => {};
 
     // Listen for storage events (other tabs)
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] EqualityOperator
src/hooks/useImageComparison.ts:133:11
     // Listen for custom events (same tab)
     const handleCustomEvent = (event: CustomEvent<ImageComparison | null>) => {
       // Validate even from custom events for extra safety
-      if (event.detail === null || isValidImageComparison(event.detail)) {
+      if (event.detail !== null || isValidImageComparison(event.detail)) {
         setComparison(event.detail as ImageComparison | null);
       }
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] ConditionalExpression
src/hooks/useImageComparison.ts:133:11
     // Listen for custom events (same tab)
     const handleCustomEvent = (event: CustomEvent<ImageComparison | null>) => {
       // Validate even from custom events for extra safety
-      if (event.detail === null || isValidImageComparison(event.detail)) {
+      if (false) {
         setComparison(event.detail as ImageComparison | null);
       }
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] BlockStatement
src/hooks/useImageComparison.ts:139:58
     };
 
     // Listen for storage events (other tabs)
-    const handleStorageChange = (event: StorageEvent) => {
-      if (event.key === STORAGE_KEY) {
-        if (event.newValue) {
-          try {
-            const parsed = JSON.parse(event.newValue);
-            if (isValidImageComparison(parsed)) {
-              setComparison(parsed as ImageComparison);
-            } else {
-              setComparison(null);
-            }
-          } catch {
-            setComparison(null);
-          }
-        } else {
-          setComparison(null);
-        }
-      }
-    };
+    const handleStorageChange = (event: StorageEvent) => {};
 
     window.addEventListener('imageComparisonChange', handleCustomEvent as EventListener);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] ConditionalExpression
src/hooks/useImageComparison.ts:140:11
 
     // Listen for storage events (other tabs)
     const handleStorageChange = (event: StorageEvent) => {
-      if (event.key === STORAGE_KEY) {
+      if (true) {
         if (event.newValue) {
           try {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] BlockStatement
src/hooks/useImageComparison.ts:141:29
     // Listen for storage events (other tabs)
     const handleStorageChange = (event: StorageEvent) => {
       if (event.key === STORAGE_KEY) {
-        if (event.newValue) {
-          try {
-            const parsed = JSON.parse(event.newValue);
-            if (isValidImageComparison(parsed)) {
-              setComparison(parsed as ImageComparison);
-            } else {
-              setComparison(null);
-            }
-          } catch {
-            setComparison(null);
-          }
-        } else {
+        if (event.newValue) {} else {
           setComparison(null);
         }
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] BlockStatement
src/hooks/useImageComparison.ts:142:15
     const handleStorageChange = (event: StorageEvent) => {
       if (event.key === STORAGE_KEY) {
         if (event.newValue) {
-          try {
-            const parsed = JSON.parse(event.newValue);
-            if (isValidImageComparison(parsed)) {
-              setComparison(parsed as ImageComparison);
-            } else {
-              setComparison(null);
-            }
-          } catch {
+          try {} catch {
             setComparison(null);
           }
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] ConditionalExpression
src/hooks/useImageComparison.ts:144:17
         if (event.newValue) {
           try {
             const parsed = JSON.parse(event.newValue);
-            if (isValidImageComparison(parsed)) {
+            if (false) {
               setComparison(parsed as ImageComparison);
             } else {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] BlockStatement
src/hooks/useImageComparison.ts:144:49
         if (event.newValue) {
           try {
             const parsed = JSON.parse(event.newValue);
-            if (isValidImageComparison(parsed)) {
-              setComparison(parsed as ImageComparison);
-            } else {
+            if (isValidImageComparison(parsed)) {} else {
               setComparison(null);
             }
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Survived] BlockStatement
src/hooks/useImageComparison.ts:146:20
             const parsed = JSON.parse(event.newValue);
             if (isValidImageComparison(parsed)) {
               setComparison(parsed as ImageComparison);
-            } else {
-              setComparison(null);
-            }
+            } else {}
           } catch {
             setComparison(null);
