[Survived] BooleanLiteral
src/hooks/useMapReady.ts:22:33
  */
 export function useMapReady() {
   const map = useMap();
-  const hasInitialized = useRef(false);
+  const hasInitialized = useRef(true);
 
   useEffect(() => {

[Survived] ArrowFunction
src/hooks/useMapReady.ts:30:18
 
     // Invalidation schedule for SPA navigation - less aggressive now that we use keys
     const timeouts = [
-      setTimeout(() => map.invalidateSize(), 0),
+      setTimeout(() => undefined, 0),
       setTimeout(() => map.invalidateSize(), 100),
       setTimeout(() => map.invalidateSize(), 300),

[Survived] ArrowFunction
src/hooks/useMapReady.ts:31:18
     // Invalidation schedule for SPA navigation - less aggressive now that we use keys
     const timeouts = [
       setTimeout(() => map.invalidateSize(), 0),
-      setTimeout(() => map.invalidateSize(), 100),
+      setTimeout(() => undefined, 100),
       setTimeout(() => map.invalidateSize(), 300),
     ];

[Survived] ArrowFunction
src/hooks/useMapReady.ts:32:18
     const timeouts = [
       setTimeout(() => map.invalidateSize(), 0),
       setTimeout(() => map.invalidateSize(), 100),
-      setTimeout(() => map.invalidateSize(), 300),
+      setTimeout(() => undefined, 300),
     ];
 

[Survived] BlockStatement
src/hooks/useMapReady.ts:37:37
 
     // Use requestAnimationFrame for smoother updates
     let rafId: number;
-    const invalidateOnFrame = () => {
-      map.invalidateSize();
-      if (!hasInitialized.current) {
-        hasInitialized.current = true;
-        // One more after initialization
-        rafId = requestAnimationFrame(() => map.invalidateSize());
-      }
-    };
+    const invalidateOnFrame = () => {};
     rafId = requestAnimationFrame(invalidateOnFrame);
 

[Survived] BooleanLiteral
src/hooks/useMapReady.ts:39:11
     let rafId: number;
     const invalidateOnFrame = () => {
       map.invalidateSize();
-      if (!hasInitialized.current) {
+      if (hasInitialized.current) {
         hasInitialized.current = true;
         // One more after initialization

[Survived] ConditionalExpression
src/hooks/useMapReady.ts:39:11
     let rafId: number;
     const invalidateOnFrame = () => {
       map.invalidateSize();
-      if (!hasInitialized.current) {
+      if (false) {
         hasInitialized.current = true;
         // One more after initialization

[Survived] BooleanLiteral
src/hooks/useMapReady.ts:40:34
     const invalidateOnFrame = () => {
       map.invalidateSize();
       if (!hasInitialized.current) {
-        hasInitialized.current = true;
+        hasInitialized.current = false;
         // One more after initialization
         rafId = requestAnimationFrame(() => map.invalidateSize());

[Survived] ArrowFunction
src/hooks/useMapReady.ts:42:39
       if (!hasInitialized.current) {
         hasInitialized.current = true;
         // One more after initialization
-        rafId = requestAnimationFrame(() => map.invalidateSize());
+        rafId = requestAnimationFrame(() => undefined);
       }
     };

[Survived] BlockStatement
src/hooks/useMapReady.ts:48:32
     rafId = requestAnimationFrame(invalidateOnFrame);
 
     // Handle window resize
-    const handleResize = () => {
-      map.invalidateSize();
-    };
+    const handleResize = () => {};
     window.addEventListener('resize', handleResize);
 

[Survived] BlockStatement
src/hooks/useMapReady.ts:54:42
     window.addEventListener('resize', handleResize);
 
     // Handle visibility change (tab switching)
-    const handleVisibilityChange = () => {
-      if (document.visibilityState === 'visible') {
-        map.invalidateSize();
-        setTimeout(() => map.invalidateSize(), 100);
-      }
-    };
+    const handleVisibilityChange = () => {};
     document.addEventListener('visibilitychange', handleVisibilityChange);
 

[Survived] EqualityOperator
src/hooks/useMapReady.ts:55:11
 
     // Handle visibility change (tab switching)
     const handleVisibilityChange = () => {
-      if (document.visibilityState === 'visible') {
+      if (document.visibilityState !== 'visible') {
         map.invalidateSize();
         setTimeout(() => map.invalidateSize(), 100);

[Survived] ArrowFunction
src/hooks/useMapReady.ts:57:20
     const handleVisibilityChange = () => {
       if (document.visibilityState === 'visible') {
         map.invalidateSize();
-        setTimeout(() => map.invalidateSize(), 100);
+        setTimeout(() => undefined, 100);
       }
     };

[Killed] ConditionalExpression
src/hooks/useMapReady.ts:65:9
     // Use ResizeObserver for container size changes
     const container = map.getContainer();
     let resizeObserver: ResizeObserver | null = null;
-    if (container && typeof ResizeObserver !== 'undefined') {
+    if (false) {
       resizeObserver = new ResizeObserver(() => {
         map.invalidateSize();
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BlockStatement
src/hooks/useMapReady.ts:65:61
     // Use ResizeObserver for container size changes
     const container = map.getContainer();
     let resizeObserver: ResizeObserver | null = null;
-    if (container && typeof ResizeObserver !== 'undefined') {
-      resizeObserver = new ResizeObserver(() => {
-        map.invalidateSize();
-      });
-      resizeObserver.observe(container);
-    }
+    if (container && typeof ResizeObserver !== 'undefined') {}
 
     return () => {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Survived] BlockStatement
src/hooks/useMapReady.ts:66:49
     const container = map.getContainer();
     let resizeObserver: ResizeObserver | null = null;
     if (container && typeof ResizeObserver !== 'undefined') {
-      resizeObserver = new ResizeObserver(() => {
-        map.invalidateSize();
-      });
+      resizeObserver = new ResizeObserver(() => {});
       resizeObserver.observe(container);
     }

[Killed] BlockStatement
src/hooks/useMapReady.ts:72:18
       resizeObserver.observe(container);
     }
 
-    return () => {
-      timeouts.forEach(clearTimeout);
-      cancelAnimationFrame(rafId);
-      window.removeEventListener('resize', handleResize);
-      document.removeEventListener('visibilitychange', handleVisibilityChange);
-      resizeObserver?.disconnect();
-    };
+    return () => {};
   }, [map]);
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Survived] OptionalChaining
src/hooks/useMapReady.ts:77:7
       cancelAnimationFrame(rafId);
       window.removeEventListener('resize', handleResize);
       document.removeEventListener('visibilitychange', handleVisibilityChange);
-      resizeObserver?.disconnect();
+      resizeObserver.disconnect();
     };
   }, [map]);

[Survived] ArrayDeclaration
src/hooks/useMapReady.ts:79:6
       document.removeEventListener('visibilitychange', handleVisibilityChange);
       resizeObserver?.disconnect();
     };
-  }, [map]);
+  }, []);
 
   return map;

[Survived] BlockStatement
src/hooks/useMapReady.ts:88:35
  * Component that fixes map sizing issues.
  * Add this as a child of MapContainer.
  */
-export function MapReadyHandler() {
-  useMapReady();
-  return null;
-}
+export function MapReadyHandler() {}
 
