[Survived] BlockStatement
src/hooks/useImageComparison.ts:149:19
             } else {
               setComparison(null);
             }
-          } catch {
-            setComparison(null);
-          }
+          } catch {}
         } else {
           setComparison(null);

[Killed] BlockStatement
src/hooks/useImageComparison.ts:152:16
           } catch {
             setComparison(null);
           }
-        } else {
-          setComparison(null);
-        }
+        } else {}
       }
     };
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] BlockStatement
src/hooks/useImageComparison.ts:161:18
     window.addEventListener('imageComparisonChange', handleCustomEvent as EventListener);
     window.addEventListener('storage', handleStorageChange);
 
-    return () => {
-      window.removeEventListener('imageComparisonChange', handleCustomEvent as EventListener);
-      window.removeEventListener('storage', handleStorageChange);
-    };
+    return () => {};
   }, []);
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z

[Killed] StringLiteral
src/hooks/useImageComparison.ts:163:34
 
     return () => {
       window.removeEventListener('imageComparisonChange', handleCustomEvent as EventListener);
-      window.removeEventListener('storage', handleStorageChange);
+      window.removeEventListener("", handleStorageChange);
     };
   }, []);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useImageComparison.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-7Ufn1z
