[Killed] LogicalOperator
src/hooks/useContactVerification.ts:79:20
   // Derivar estado de verificacion del auth store
   const contactoVerificado = !!user && initialized;
   const userEmail = user?.email || null;
-  const userName = profile?.nombre || user?.user_metadata?.full_name || user?.user_metadata?.name || null;
+  const userName = (profile?.nombre || user?.user_metadata?.full_name) && user?.user_metadata?.name || null;
 
   // Notificar cuando se verifica
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-b1X46Q

[Killed] LogicalOperator
src/hooks/useContactVerification.ts:79:20
   // Derivar estado de verificacion del auth store
   const contactoVerificado = !!user && initialized;
   const userEmail = user?.email || null;
-  const userName = profile?.nombre || user?.user_metadata?.full_name || user?.user_metadata?.name || null;
+  const userName = profile?.nombre && user?.user_metadata?.full_name || user?.user_metadata?.name || null;
 
   // Notificar cuando se verifica
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useContactVerification.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-b1X46Q
