[Killed] BlockStatement
src/hooks/useSelectedImage.ts:63:29
   useEffect(() => {
     const handleStorageChange = (event: StorageEvent) => {
       if (event.key === STORAGE_KEY) {
-        if (event.newValue) {
-          try {
-            const parsed = JSON.parse(event.newValue);
-            // Validate data structure before using
-            if (isValidSelectedImage(parsed)) {
-              setSelectedImageState(parsed as SelectedImage);
-            } else {
-              setSelectedImageState(null);
-            }
-          } catch {
-            setSelectedImageState(null);
-          }
-        } else {
+        if (event.newValue) {} else {
           setSelectedImageState(null);
         }
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-m47yQc

[Killed] BlockStatement
src/hooks/useSelectedImage.ts:156:29
     // Listen for storage events (other tabs)
     const handleStorageChange = (event: StorageEvent) => {
       if (event.key === STORAGE_KEY) {
-        if (event.newValue) {
-          try {
-            const parsed = JSON.parse(event.newValue);
-            if (isValidSelectedImage(parsed)) {
-              setSelectedImage(parsed as SelectedImage);
-            } else {
-              setSelectedImage(null);
-            }
-          } catch {
-            setSelectedImage(null);
-          }
-        } else {
+        if (event.newValue) {} else {
           setSelectedImage(null);
         }
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-m47yQc
