[Killed] BlockStatement
components/admin/management/tramitesCanonical.ts:21:3
 export function filterCanonicalTramites(items: RawTramiteItem[]): {
   canonical: CanonicalTramiteItem[];
   discarded: RawTramiteItem[];
-} {
-  const canonical: CanonicalTramiteItem[] = [];
-  const discarded: RawTramiteItem[] = [];
-
-  for (const item of items) {
-    if (isCanonicalTramiteEstado(item.estado)) {
-      canonical.push(item as CanonicalTramiteItem);
-    } else {
-      discarded.push(item);
-    }
-  }
-
-  return { canonical, discarded };
-}
+} {}
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/unit/reportsResolve.test.ts tests/unit/tramitesCanonical.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-XV7l9D

[Killed] BlockStatement
components/admin/management/tramitesCanonical.ts:25:29
   const canonical: CanonicalTramiteItem[] = [];
   const discarded: RawTramiteItem[] = [];
 
-  for (const item of items) {
-    if (isCanonicalTramiteEstado(item.estado)) {
-      canonical.push(item as CanonicalTramiteItem);
-    } else {
-      discarded.push(item);
-    }
-  }
+  for (const item of items) {}
 
   return { canonical, discarded };
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/unit/reportsResolve.test.ts tests/unit/tramitesCanonical.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-XV7l9D

[Killed] ConditionalExpression
components/admin/management/tramitesCanonical.ts:26:9
   const discarded: RawTramiteItem[] = [];
 
   for (const item of items) {
-    if (isCanonicalTramiteEstado(item.estado)) {
+    if (false) {
       canonical.push(item as CanonicalTramiteItem);
     } else {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/unit/reportsResolve.test.ts tests/unit/tramitesCanonical.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-XV7l9D

[Killed] ConditionalExpression
components/admin/management/tramitesCanonical.ts:26:9
   const discarded: RawTramiteItem[] = [];
 
   for (const item of items) {
-    if (isCanonicalTramiteEstado(item.estado)) {
+    if (true) {
       canonical.push(item as CanonicalTramiteItem);
     } else {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/unit/reportsResolve.test.ts tests/unit/tramitesCanonical.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-XV7l9D

[Killed] BlockStatement
components/admin/management/tramitesCanonical.ts:28:12
   for (const item of items) {
     if (isCanonicalTramiteEstado(item.estado)) {
       canonical.push(item as CanonicalTramiteItem);
-    } else {
-      discarded.push(item);
-    }
+    } else {}
   }
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/unit/reportsResolve.test.ts tests/unit/tramitesCanonical.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web/.stryker-tmp/sandbox-XV7l9D
