[Survived] BooleanLiteral
src/hooks/useSelectedImage.ts:35:46
  */
 export function useSelectedImage() {
   const [selectedImage, setSelectedImageState] = useState<SelectedImage | null>(null);
-  const [isLoading, setIsLoading] = useState(true);
+  const [isLoading, setIsLoading] = useState(false);
 
   // Load from localStorage on mount

[Killed] BlockStatement
src/hooks/useSelectedImage.ts:38:19
   const [isLoading, setIsLoading] = useState(true);
 
   // Load from localStorage on mount
-  useEffect(() => {
-    try {
-      const stored = localStorage.getItem(STORAGE_KEY);
-      if (stored) {
-        const parsed = JSON.parse(stored);
-        // Validate data structure before using
-        if (isValidSelectedImage(parsed)) {
-          setSelectedImageState(parsed as SelectedImage);
-        } else {
-          logger.warn('Invalid selected image data in localStorage, clearing');
-          localStorage.removeItem(STORAGE_KEY);
-        }
-      }
-    } catch (error) {
-      logger.error('Error loading selected image from localStorage:', error);
-      localStorage.removeItem(STORAGE_KEY);
-    } finally {
-      setIsLoading(false);
-    }
-  }, []);
+  useEffect(() => {}, []);
 
   // Listen for changes from other tabs/windows
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BlockStatement
src/hooks/useSelectedImage.ts:39:9
 
   // Load from localStorage on mount
   useEffect(() => {
-    try {
-      const stored = localStorage.getItem(STORAGE_KEY);
-      if (stored) {
-        const parsed = JSON.parse(stored);
-        // Validate data structure before using
-        if (isValidSelectedImage(parsed)) {
-          setSelectedImageState(parsed as SelectedImage);
-        } else {
-          logger.warn('Invalid selected image data in localStorage, clearing');
-          localStorage.removeItem(STORAGE_KEY);
-        }
-      }
-    } catch (error) {
+    try {} catch (error) {
       logger.error('Error loading selected image from localStorage:', error);
       localStorage.removeItem(STORAGE_KEY);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] ConditionalExpression
src/hooks/useSelectedImage.ts:41:11
   useEffect(() => {
     try {
       const stored = localStorage.getItem(STORAGE_KEY);
-      if (stored) {
+      if (false) {
         const parsed = JSON.parse(stored);
         // Validate data structure before using
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BlockStatement
src/hooks/useSelectedImage.ts:41:19
   useEffect(() => {
     try {
       const stored = localStorage.getItem(STORAGE_KEY);
-      if (stored) {
-        const parsed = JSON.parse(stored);
-        // Validate data structure before using
-        if (isValidSelectedImage(parsed)) {
-          setSelectedImageState(parsed as SelectedImage);
-        } else {
-          logger.warn('Invalid selected image data in localStorage, clearing');
-          localStorage.removeItem(STORAGE_KEY);
-        }
-      }
+      if (stored) {}
     } catch (error) {
       logger.error('Error loading selected image from localStorage:', error);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BlockStatement
src/hooks/useSelectedImage.ts:44:43
       if (stored) {
         const parsed = JSON.parse(stored);
         // Validate data structure before using
-        if (isValidSelectedImage(parsed)) {
-          setSelectedImageState(parsed as SelectedImage);
-        } else {
+        if (isValidSelectedImage(parsed)) {} else {
           logger.warn('Invalid selected image data in localStorage, clearing');
           localStorage.removeItem(STORAGE_KEY);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] ConditionalExpression
src/hooks/useSelectedImage.ts:44:13
       if (stored) {
         const parsed = JSON.parse(stored);
         // Validate data structure before using
-        if (isValidSelectedImage(parsed)) {
+        if (true) {
           setSelectedImageState(parsed as SelectedImage);
         } else {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BlockStatement
src/hooks/useSelectedImage.ts:46:16
         // Validate data structure before using
         if (isValidSelectedImage(parsed)) {
           setSelectedImageState(parsed as SelectedImage);
-        } else {
-          logger.warn('Invalid selected image data in localStorage, clearing');
-          localStorage.removeItem(STORAGE_KEY);
-        }
+        } else {}
       }
     } catch (error) {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Survived] StringLiteral
src/hooks/useSelectedImage.ts:47:23
         if (isValidSelectedImage(parsed)) {
           setSelectedImageState(parsed as SelectedImage);
         } else {
-          logger.warn('Invalid selected image data in localStorage, clearing');
+          logger.warn("");
           localStorage.removeItem(STORAGE_KEY);
         }

[Killed] BlockStatement
src/hooks/useSelectedImage.ts:51:21
           localStorage.removeItem(STORAGE_KEY);
         }
       }
-    } catch (error) {
-      logger.error('Error loading selected image from localStorage:', error);
-      localStorage.removeItem(STORAGE_KEY);
-    } finally {
+    } catch (error) {} finally {
       setIsLoading(false);
     }
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Survived] StringLiteral
src/hooks/useSelectedImage.ts:52:20
         }
       }
     } catch (error) {
-      logger.error('Error loading selected image from localStorage:', error);
+      logger.error("", error);
       localStorage.removeItem(STORAGE_KEY);
     } finally {

[Killed] BlockStatement
src/hooks/useSelectedImage.ts:54:15
     } catch (error) {
       logger.error('Error loading selected image from localStorage:', error);
       localStorage.removeItem(STORAGE_KEY);
-    } finally {
-      setIsLoading(false);
-    }
+    } finally {}
   }, []);
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Survived] BlockStatement
src/hooks/useSelectedImage.ts:60:19
   }, []);
 
   // Listen for changes from other tabs/windows
-  useEffect(() => {
-    const handleStorageChange = (event: StorageEvent) => {
-      if (event.key === STORAGE_KEY) {
-        if (event.newValue) {
-          try {
-            const parsed = JSON.parse(event.newValue);
-            // Validate data structure before using
-            if (isValidSelectedImage(parsed)) {
-              setSelectedImageState(parsed as SelectedImage);
-            } else {
-              setSelectedImageState(null);
-            }
-          } catch {
-            setSelectedImageState(null);
-          }
-        } else {
-          setSelectedImageState(null);
-        }
-      }
-    };
-
-    window.addEventListener('storage', handleStorageChange);
-    return () => window.removeEventListener('storage', handleStorageChange);
-  }, []);
+  useEffect(() => {}, []);
 
   // Set the selected image

[Survived] BlockStatement
src/hooks/useSelectedImage.ts:61:58
 
   // Listen for changes from other tabs/windows
   useEffect(() => {
-    const handleStorageChange = (event: StorageEvent) => {
-      if (event.key === STORAGE_KEY) {
-        if (event.newValue) {
-          try {
-            const parsed = JSON.parse(event.newValue);
-            // Validate data structure before using
-            if (isValidSelectedImage(parsed)) {
-              setSelectedImageState(parsed as SelectedImage);
-            } else {
-              setSelectedImageState(null);
-            }
-          } catch {
-            setSelectedImageState(null);
-          }
-        } else {
-          setSelectedImageState(null);
-        }
-      }
-    };
+    const handleStorageChange = (event: StorageEvent) => {};
 
     window.addEventListener('storage', handleStorageChange);

[Survived] ConditionalExpression
src/hooks/useSelectedImage.ts:62:11
   // Listen for changes from other tabs/windows
   useEffect(() => {
     const handleStorageChange = (event: StorageEvent) => {
-      if (event.key === STORAGE_KEY) {
+      if (false) {
         if (event.newValue) {
           try {

[Survived] BlockStatement
src/hooks/useSelectedImage.ts:62:38
   // Listen for changes from other tabs/windows
   useEffect(() => {
     const handleStorageChange = (event: StorageEvent) => {
-      if (event.key === STORAGE_KEY) {
-        if (event.newValue) {
-          try {
-            const parsed = JSON.parse(event.newValue);
-            // Validate data structure before using
-            if (isValidSelectedImage(parsed)) {
-              setSelectedImageState(parsed as SelectedImage);
-            } else {
-              setSelectedImageState(null);
-            }
-          } catch {
-            setSelectedImageState(null);
-          }
-        } else {
-          setSelectedImageState(null);
-        }
-      }
+      if (event.key === STORAGE_KEY) {}
     };
 

[Survived] ConditionalExpression
src/hooks/useSelectedImage.ts:63:13
   useEffect(() => {
     const handleStorageChange = (event: StorageEvent) => {
       if (event.key === STORAGE_KEY) {
-        if (event.newValue) {
+        if (false) {
           try {
             const parsed = JSON.parse(event.newValue);

[Survived] ConditionalExpression
src/hooks/useSelectedImage.ts:63:13
   useEffect(() => {
     const handleStorageChange = (event: StorageEvent) => {
       if (event.key === STORAGE_KEY) {
-        if (event.newValue) {
+        if (true) {
           try {
             const parsed = JSON.parse(event.newValue);

[Survived] BlockStatement
src/hooks/useSelectedImage.ts:64:15
     const handleStorageChange = (event: StorageEvent) => {
       if (event.key === STORAGE_KEY) {
         if (event.newValue) {
-          try {
-            const parsed = JSON.parse(event.newValue);
-            // Validate data structure before using
-            if (isValidSelectedImage(parsed)) {
-              setSelectedImageState(parsed as SelectedImage);
-            } else {
-              setSelectedImageState(null);
-            }
-          } catch {
+          try {} catch {
             setSelectedImageState(null);
           }

[Survived] ConditionalExpression
src/hooks/useSelectedImage.ts:67:17
           try {
             const parsed = JSON.parse(event.newValue);
             // Validate data structure before using
-            if (isValidSelectedImage(parsed)) {
+            if (false) {
               setSelectedImageState(parsed as SelectedImage);
             } else {

[Survived] BlockStatement
src/hooks/useSelectedImage.ts:69:20
             // Validate data structure before using
             if (isValidSelectedImage(parsed)) {
               setSelectedImageState(parsed as SelectedImage);
-            } else {
-              setSelectedImageState(null);
-            }
+            } else {}
           } catch {
             setSelectedImageState(null);

[Survived] BlockStatement
src/hooks/useSelectedImage.ts:72:19
             } else {
               setSelectedImageState(null);
             }
-          } catch {
-            setSelectedImageState(null);
-          }
+          } catch {}
         } else {
           setSelectedImageState(null);

[Survived] BlockStatement
src/hooks/useSelectedImage.ts:75:16
           } catch {
             setSelectedImageState(null);
           }
-        } else {
-          setSelectedImageState(null);
-        }
+        } else {}
       }
     };

[Survived] ArrowFunction
src/hooks/useSelectedImage.ts:82:12
     };
 
     window.addEventListener('storage', handleStorageChange);
-    return () => window.removeEventListener('storage', handleStorageChange);
+    return () => undefined;
   }, []);
 

[Survived] StringLiteral
src/hooks/useSelectedImage.ts:82:45
     };
 
     window.addEventListener('storage', handleStorageChange);
-    return () => window.removeEventListener('storage', handleStorageChange);
+    return () => window.removeEventListener("", handleStorageChange);
   }, []);
 

[Survived] ArrayDeclaration
src/hooks/useSelectedImage.ts:83:6
 
     window.addEventListener('storage', handleStorageChange);
     return () => window.removeEventListener('storage', handleStorageChange);
-  }, []);
+  }, ["Stryker was here"]);
 
   // Set the selected image

[Killed] BlockStatement
src/hooks/useSelectedImage.ts:86:73
   }, []);
 
   // Set the selected image
-  const setSelectedImage = useCallback((image: SelectedImage | null) => {
-    if (image) {
-      const imageWithTimestamp = {
-        ...image,
-        selected_at: new Date().toISOString(),
-      };
-      localStorage.setItem(STORAGE_KEY, JSON.stringify(imageWithTimestamp));
-      setSelectedImageState(imageWithTimestamp);
-    } else {
-      localStorage.removeItem(STORAGE_KEY);
-      setSelectedImageState(null);
-    }
-
-    // Dispatch custom event for same-tab updates
-    window.dispatchEvent(new CustomEvent('selectedImageChange', { detail: image }));
-  }, []);
+  const setSelectedImage = useCallback((image: SelectedImage | null) => {}, []);
 
   // Clear the selected image
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] ConditionalExpression
src/hooks/useSelectedImage.ts:87:9
 
   // Set the selected image
   const setSelectedImage = useCallback((image: SelectedImage | null) => {
-    if (image) {
+    if (false) {
       const imageWithTimestamp = {
         ...image,
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BlockStatement
src/hooks/useSelectedImage.ts:87:16
 
   // Set the selected image
   const setSelectedImage = useCallback((image: SelectedImage | null) => {
-    if (image) {
-      const imageWithTimestamp = {
-        ...image,
-        selected_at: new Date().toISOString(),
-      };
-      localStorage.setItem(STORAGE_KEY, JSON.stringify(imageWithTimestamp));
-      setSelectedImageState(imageWithTimestamp);
-    } else {
+    if (image) {} else {
       localStorage.removeItem(STORAGE_KEY);
       setSelectedImageState(null);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Survived] BlockStatement
src/hooks/useSelectedImage.ts:94:12
       };
       localStorage.setItem(STORAGE_KEY, JSON.stringify(imageWithTimestamp));
       setSelectedImageState(imageWithTimestamp);
-    } else {
-      localStorage.removeItem(STORAGE_KEY);
-      setSelectedImageState(null);
-    }
+    } else {}
 
     // Dispatch custom event for same-tab updates

[Killed] BlockStatement
src/hooks/useSelectedImage.ts:104:48
   }, []);
 
   // Clear the selected image
-  const clearSelectedImage = useCallback(() => {
-    localStorage.removeItem(STORAGE_KEY);
-    setSelectedImageState(null);
-    window.dispatchEvent(new CustomEvent('selectedImageChange', { detail: null }));
-  }, []);
+  const clearSelectedImage = useCallback(() => {}, []);
 
   // Check if an image is currently selected
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Survived] StringLiteral
src/hooks/useSelectedImage.ts:107:42
   const clearSelectedImage = useCallback(() => {
     localStorage.removeItem(STORAGE_KEY);
     setSelectedImageState(null);
-    window.dispatchEvent(new CustomEvent('selectedImageChange', { detail: null }));
+    window.dispatchEvent(new CustomEvent("", { detail: null }));
   }, []);
 

[Killed] EqualityOperator
src/hooks/useSelectedImage.ts:111:28
   }, []);
 
   // Check if an image is currently selected
-  const hasSelectedImage = selectedImage !== null;
+  const hasSelectedImage = selectedImage === null;
 
   return {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] ConditionalExpression
src/hooks/useSelectedImage.ts:111:28
   }, []);
 
   // Check if an image is currently selected
-  const hasSelectedImage = selectedImage !== null;
+  const hasSelectedImage = false;
 
   return {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BlockStatement
src/hooks/useSelectedImage.ts:131:9
 
   useEffect(() => {
     // Load initial value with validation
-    try {
-      const stored = localStorage.getItem(STORAGE_KEY);
-      if (stored) {
-        const parsed = JSON.parse(stored);
-        if (isValidSelectedImage(parsed)) {
-          setSelectedImage(parsed as SelectedImage);
-        } else {
-          localStorage.removeItem(STORAGE_KEY);
-        }
-      }
-    } catch {
+    try {} catch {
       localStorage.removeItem(STORAGE_KEY);
     }
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BlockStatement
src/hooks/useSelectedImage.ts:133:19
     // Load initial value with validation
     try {
       const stored = localStorage.getItem(STORAGE_KEY);
-      if (stored) {
-        const parsed = JSON.parse(stored);
-        if (isValidSelectedImage(parsed)) {
-          setSelectedImage(parsed as SelectedImage);
-        } else {
-          localStorage.removeItem(STORAGE_KEY);
-        }
-      }
+      if (stored) {}
     } catch {
       localStorage.removeItem(STORAGE_KEY);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] ConditionalExpression
src/hooks/useSelectedImage.ts:135:13
       const stored = localStorage.getItem(STORAGE_KEY);
       if (stored) {
         const parsed = JSON.parse(stored);
-        if (isValidSelectedImage(parsed)) {
+        if (false) {
           setSelectedImage(parsed as SelectedImage);
         } else {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BlockStatement
src/hooks/useSelectedImage.ts:135:43
       const stored = localStorage.getItem(STORAGE_KEY);
       if (stored) {
         const parsed = JSON.parse(stored);
-        if (isValidSelectedImage(parsed)) {
-          setSelectedImage(parsed as SelectedImage);
-        } else {
+        if (isValidSelectedImage(parsed)) {} else {
           localStorage.removeItem(STORAGE_KEY);
         }
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Survived] BlockStatement
src/hooks/useSelectedImage.ts:137:16
         const parsed = JSON.parse(stored);
         if (isValidSelectedImage(parsed)) {
           setSelectedImage(parsed as SelectedImage);
-        } else {
-          localStorage.removeItem(STORAGE_KEY);
-        }
+        } else {}
       }
     } catch {

[Survived] BlockStatement
src/hooks/useSelectedImage.ts:141:13
           localStorage.removeItem(STORAGE_KEY);
         }
       }
-    } catch {
-      localStorage.removeItem(STORAGE_KEY);
-    }
+    } catch {}
 
     // Listen for custom events (same tab)

[Killed] BlockStatement
src/hooks/useSelectedImage.ts:146:77
     }
 
     // Listen for custom events (same tab)
-    const handleCustomEvent = (event: CustomEvent<SelectedImage | null>) => {
-      // Custom events come from our own code, but validate anyway
-      if (event.detail === null || isValidSelectedImage(event.detail)) {
-        setSelectedImage(event.detail as SelectedImage | null);
-      }
-    };
+    const handleCustomEvent = (event: CustomEvent<SelectedImage | null>) => {};
 
     // Listen for storage events (other tabs)
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BlockStatement
src/hooks/useSelectedImage.ts:148:72
     // Listen for custom events (same tab)
     const handleCustomEvent = (event: CustomEvent<SelectedImage | null>) => {
       // Custom events come from our own code, but validate anyway
-      if (event.detail === null || isValidSelectedImage(event.detail)) {
-        setSelectedImage(event.detail as SelectedImage | null);
-      }
+      if (event.detail === null || isValidSelectedImage(event.detail)) {}
     };
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] ConditionalExpression
src/hooks/useSelectedImage.ts:148:11
     // Listen for custom events (same tab)
     const handleCustomEvent = (event: CustomEvent<SelectedImage | null>) => {
       // Custom events come from our own code, but validate anyway
-      if (event.detail === null || isValidSelectedImage(event.detail)) {
+      if (false) {
         setSelectedImage(event.detail as SelectedImage | null);
       }
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BlockStatement
src/hooks/useSelectedImage.ts:154:58
     };
 
     // Listen for storage events (other tabs)
-    const handleStorageChange = (event: StorageEvent) => {
-      if (event.key === STORAGE_KEY) {
-        if (event.newValue) {
-          try {
-            const parsed = JSON.parse(event.newValue);
-            if (isValidSelectedImage(parsed)) {
-              setSelectedImage(parsed as SelectedImage);
-            } else {
-              setSelectedImage(null);
-            }
-          } catch {
-            setSelectedImage(null);
-          }
-        } else {
-          setSelectedImage(null);
-        }
-      }
-    };
+    const handleStorageChange = (event: StorageEvent) => {};
 
     window.addEventListener('selectedImageChange', handleCustomEvent as EventListener);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BlockStatement
src/hooks/useSelectedImage.ts:155:38
 
     // Listen for storage events (other tabs)
     const handleStorageChange = (event: StorageEvent) => {
-      if (event.key === STORAGE_KEY) {
-        if (event.newValue) {
-          try {
-            const parsed = JSON.parse(event.newValue);
-            if (isValidSelectedImage(parsed)) {
-              setSelectedImage(parsed as SelectedImage);
-            } else {
-              setSelectedImage(null);
-            }
-          } catch {
-            setSelectedImage(null);
-          }
-        } else {
-          setSelectedImage(null);
-        }
-      }
+      if (event.key === STORAGE_KEY) {}
     };
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] EqualityOperator
src/hooks/useSelectedImage.ts:155:11
 
     // Listen for storage events (other tabs)
     const handleStorageChange = (event: StorageEvent) => {
-      if (event.key === STORAGE_KEY) {
+      if (event.key !== STORAGE_KEY) {
         if (event.newValue) {
           try {
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Survived] BlockStatement
src/hooks/useSelectedImage.ts:157:15
     const handleStorageChange = (event: StorageEvent) => {
       if (event.key === STORAGE_KEY) {
         if (event.newValue) {
-          try {
-            const parsed = JSON.parse(event.newValue);
-            if (isValidSelectedImage(parsed)) {
-              setSelectedImage(parsed as SelectedImage);
-            } else {
-              setSelectedImage(null);
-            }
-          } catch {
+          try {} catch {
             setSelectedImage(null);
           }

[Survived] ConditionalExpression
src/hooks/useSelectedImage.ts:159:17
         if (event.newValue) {
           try {
             const parsed = JSON.parse(event.newValue);
-            if (isValidSelectedImage(parsed)) {
+            if (true) {
               setSelectedImage(parsed as SelectedImage);
             } else {

[Survived] BlockStatement
src/hooks/useSelectedImage.ts:159:47
         if (event.newValue) {
           try {
             const parsed = JSON.parse(event.newValue);
-            if (isValidSelectedImage(parsed)) {
-              setSelectedImage(parsed as SelectedImage);
-            } else {
+            if (isValidSelectedImage(parsed)) {} else {
               setSelectedImage(null);
             }

[Survived] BlockStatement
src/hooks/useSelectedImage.ts:161:20
             const parsed = JSON.parse(event.newValue);
             if (isValidSelectedImage(parsed)) {
               setSelectedImage(parsed as SelectedImage);
-            } else {
-              setSelectedImage(null);
-            }
+            } else {}
           } catch {
             setSelectedImage(null);

[Survived] BlockStatement
src/hooks/useSelectedImage.ts:164:19
             } else {
               setSelectedImage(null);
             }
-          } catch {
-            setSelectedImage(null);
-          }
+          } catch {}
         } else {
           setSelectedImage(null);

[Killed] BlockStatement
src/hooks/useSelectedImage.ts:167:16
           } catch {
             setSelectedImage(null);
           }
-        } else {
-          setSelectedImage(null);
-        }
+        } else {}
       }
     };
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Survived] BlockStatement
src/hooks/useSelectedImage.ts:176:18
     window.addEventListener('selectedImageChange', handleCustomEvent as EventListener);
     window.addEventListener('storage', handleStorageChange);
 
-    return () => {
-      window.removeEventListener('selectedImageChange', handleCustomEvent as EventListener);
-      window.removeEventListener('storage', handleStorageChange);
-    };
+    return () => {};
   }, []);
 
