[Survived] StringLiteral
src/hooks/useSelectedImage.ts:177:34
     window.addEventListener('storage', handleStorageChange);
 
     return () => {
-      window.removeEventListener('selectedImageChange', handleCustomEvent as EventListener);
+      window.removeEventListener("", handleCustomEvent as EventListener);
       window.removeEventListener('storage', handleStorageChange);
     };

[Survived] StringLiteral
src/hooks/useSelectedImage.ts:178:34
 
     return () => {
       window.removeEventListener('selectedImageChange', handleCustomEvent as EventListener);
-      window.removeEventListener('storage', handleStorageChange);
+      window.removeEventListener("", handleStorageChange);
     };
   }, []);

[Killed] BlockStatement
src/hooks/useSelectedImage.ts:189:62
  * Get selected image synchronously (for non-React contexts).
  * Validates the data before returning to prevent XSS attacks.
  */
-export function getSelectedImageSync(): SelectedImage | null {
-  try {
-    const stored = localStorage.getItem(STORAGE_KEY);
-    if (!stored) return null;
-
-    const parsed = JSON.parse(stored);
-    if (isValidSelectedImage(parsed)) {
-      return parsed as SelectedImage;
-    }
-
-    // Invalid data, clean up
-    localStorage.removeItem(STORAGE_KEY);
-    return null;
-  } catch {
-    localStorage.removeItem(STORAGE_KEY);
-    return null;
-  }
-}
+export function getSelectedImageSync(): SelectedImage | null {}
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BlockStatement
src/hooks/useSelectedImage.ts:190:7
  * Validates the data before returning to prevent XSS attacks.
  */
 export function getSelectedImageSync(): SelectedImage | null {
-  try {
-    const stored = localStorage.getItem(STORAGE_KEY);
-    if (!stored) return null;
-
-    const parsed = JSON.parse(stored);
-    if (isValidSelectedImage(parsed)) {
-      return parsed as SelectedImage;
-    }
-
-    // Invalid data, clean up
-    localStorage.removeItem(STORAGE_KEY);
-    return null;
-  } catch {
+  try {} catch {
     localStorage.removeItem(STORAGE_KEY);
     return null;
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BooleanLiteral
src/hooks/useSelectedImage.ts:192:9
 export function getSelectedImageSync(): SelectedImage | null {
   try {
     const stored = localStorage.getItem(STORAGE_KEY);
-    if (!stored) return null;
+    if (stored) return null;
 
     const parsed = JSON.parse(stored);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] ConditionalExpression
src/hooks/useSelectedImage.ts:192:9
 export function getSelectedImageSync(): SelectedImage | null {
   try {
     const stored = localStorage.getItem(STORAGE_KEY);
-    if (!stored) return null;
+    if (true) return null;
 
     const parsed = JSON.parse(stored);
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BlockStatement
src/hooks/useSelectedImage.ts:195:39
     if (!stored) return null;
 
     const parsed = JSON.parse(stored);
-    if (isValidSelectedImage(parsed)) {
-      return parsed as SelectedImage;
-    }
+    if (isValidSelectedImage(parsed)) {}
 
     // Invalid data, clean up
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web

[Killed] BlockStatement
src/hooks/useSelectedImage.ts:202:11
     // Invalid data, clean up
     localStorage.removeItem(STORAGE_KEY);
     return null;
-  } catch {
-    localStorage.removeItem(STORAGE_KEY);
-    return null;
-  }
+  } catch {}
 }
 
killedBy: All tests
statusReason: > consorcio-web@0.0.1 test:run
> vitest run tests/hooks/useSelectedImage.test.ts tests/hooks/useJobStatus.test.ts tests/hooks/useMapReady.test.ts




 RUN  v4.0.16 /home/javier/consorcio-canalero/consorcio-web
